# Введення розміру масиву N
N = int(input("Введіть розмір масиву: "))
while N < 0:
    print("Розмір масиву повинен бути більше 0. Будь ласка, введіть ще раз.")
    N = int(input("Введіть розмір масиву: "))

# Ініціалізація порожнього масиву
arr = []

# Заповнення масиву елементами, введеними користувачем
for i in range(N):
    element = int(input(f"Введіть {i+1}-й елемент: "))
    arr.append(element)

# Ініціалізація змінної для зберігання добутку
product = 1

# Обчислення добутку всіх елементів масиву з непарними індексами
for i in range(N):
    if i % 2 != 0:  # Перевірка на непарний індекс
        product *= arr[i]

# Виведення результату
print("Добуток елементів з непарними індексами:", product)
