import pandas as pd

df = pd.DataFrame(
    {'Марка автомобіля' : 
        ['Ford','Volvo','Mercedes-Benz','Volkswagen','Infiniti','Toyota','Nissan','Chevrolet','Chery'],        
    'Потужність, к.с.' : 
        ['120', '100', '200','50','30','80','110','25','15'],
    'Вартість' : 
        [120000,25000,500000,15000,14000,64025,36520,58600,10200]})
print(df)
print(df["Марка автомобіля"])
print("Мінімальна потужність, к.с. = ", df["Потужність, к.с."].min())
print("Максимальна вартість = ", df["Вартість"].max())

